In [2]:
import pandas as pd

In [2]:
house_rental = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/house_rental_data.csv.txt',index_col='Unnamed: 0')

In [3]:
house_rental.head(5)

       Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom  Price
1  1177.698      2           7        2            2         2  62000
2  2134.800      5           7        4            2         2  78000
3  1138.560      5           7        2            2         1  58000
4  1458.780      2           7        3            2         2  45000
5   967.776     11          14        3            2         2  45000

In [5]:
from sklearn.linear_model import LinearRegression

In [6]:
lr = LinearRegression()

In [8]:
feature_data = house_rental.drop('Price',axis = 1)

In [10]:
feature_data.head(5)

       Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom
1  1177.698      2           7        2            2         2
2  2134.800      5           7        4            2         2
3  1138.560      5           7        2            2         1
4  1458.780      2           7        3            2         2
5   967.776     11          14        3            2         2

In [9]:
target_data = house_rental.Price

In [12]:
target_data.head(2)

1    62000
2    78000
Name: Price, dtype: int64

In [7]:
from sklearn.model_selection import train_test_split

In [13]:
trainX, testX, trainY, testY = train_test_split(feature_data,target_data)

In [14]:
trainX

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom
617   889.500      5           9        1            1         1
626  3095.460      1           6        4            2         3
108  3202.200     12          12        5            3         3
529  1387.620      4           4        3            2         2
250   882.384     10          14        1            1         1
..        ...    ...         ...      ...          ...       ...
16   2768.124      6          19        3            2         2
600  1359.156      7          16        3            2         2
206   604.860      3          12        1            1         1
228   590.628      8           9        1            2         1
340  1579.752      3          12        5            1         1

[483 rows x 6 columns]

In [15]:
lr.fit(trainX,trainY)

LinearRegression()

In [18]:
lr.predict(testX[:2])

array([45790.03634534, 29470.40289971])

In [20]:
testX[:2]

         Sqft  Floor  TotalFloor  Bedroom  Living.Room  Bathroom
135  1135.002      7          12        3            2         1
401   718.716      5          12        2            2         1

In [21]:
testY[:2]

135    40000
401    35000
Name: Price, dtype: int64

In [3]:
air_quality_data = pd.read_excel('E:\DataScience\Data\AirQualityUCI.xlsx')

In [4]:
air_quality_data.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,2004-03-10,18:00:00,2.6,1360.00,150,11.881723,1045.50,166.0,1056.25,113.0,1692.00,1267.50,13.60,48.875001,0.757754
1,2004-03-10,19:00:00,2.0,1292.25,112,9.397165,954.75,103.0,1173.75,92.0,1558.75,972.25,13.30,47.700000,0.725487
2,2004-03-10,20:00:00,2.2,1402.00,88,8.997817,939.25,131.0,1140.00,114.0,1554.50,1074.00,11.90,53.975000,0.750239
3,2004-03-10,21:00:00,2.2,1375.50,80,9.228796,948.25,172.0,1092.00,122.0,1583.75,1203.25,11.00,60.000000,0.786713
4,2004-03-10,22:00:00,1.6,1272.25,51,6.518224,835.50,131.0,1205.00,116.0,1490.00,1110.00,11.15,59.575001,0.788794

In [5]:
air_quality_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   datetime64[ns]
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   int64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: datetime64[ns](1), float64(12), int64(1), object(1)
memory usage: 1.1+ MB

In [7]:
target_data = air_quality_data.AH

In [11]:
feature_data = air_quality_data.drop(columns = ['Date','Time','AH'])

In [12]:
feature_data

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH
0,2.6,1360.00,150,11.881723,1045.50,166.0,1056.25,113.0,1692.00,1267.50,13.600,48.875001
1,2.0,1292.25,112,9.397165,954.75,103.0,1173.75,92.0,1558.75,972.25,13.300,47.700000
2,2.2,1402.00,88,8.997817,939.25,131.0,1140.00,114.0,1554.50,1074.00,11.900,53.975000
3,2.2,1375.50,80,9.228796,948.25,172.0,1092.00,122.0,1583.75,1203.25,11.000,60.000000
4,1.6,1272.25,51,6.518224,835.50,131.0,1205.00,116.0,1490.00,1110.00,11.150,59.575001
...,...,...,...,...,...,...,...,...,...,...,...,...
9352,3.1,1314.25,-200,13.529605,1101.25,471.7,538.50,189.8,1374.25,1728.50,21.850,29.250000
9353,2.4,1162.50,-200,11.355157,1027.00,353.3,603.75,179.2,1263.50,1269.00,24.325,23.725000
9354,2.4,1142.00,-200,12.374538,1062.50,293.0,603.25,174.7,1240.75,1092.00,26.900,18.350000
9355,2.1,1002.50,-200,9.547187,960.50,234.5,701.50,155.7,1041.00,769.75,28.325,13.550000
9356,2.2,1070.75,-200,11.932060,1047.25,265.2,654.00,167.7,1128.50,816.00,28.500,13.125000

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
trainX,testX,trainY,testY = train_test_split(feature_data,target_data)

In [15]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.svm import SVR
from sklearn.ensemble import RandomForestRegressor

In [16]:
dt = DecisionTreeRegressor()
svr = SVR()
rf = RandomForestRegressor()

In [17]:
dt.fit(trainX,trainY)

DecisionTreeRegressor()

In [18]:
testX[:2]

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH
1673,2.1,1155.75,-200,11.546103,1033.75,154.0,813.25,122.0,1640.0,1123.0,27.724999,26.350
2245,0.6,865.25,-200,4.765319,751.50,65.0,996.00,64.0,1450.5,837.0,21.350000,42.325

In [19]:
testY[:2]

1673    0.965174
2245    1.062529
Name: AH, dtype: float64

In [20]:
dt.predict(testX[:2])

array([0.9403753 , 1.01566598])

In [21]:
rf.fit(trainX,trainY)

RandomForestRegressor()

In [23]:
testX[:2]

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH
1673,2.1,1155.75,-200,11.546103,1033.75,154.0,813.25,122.0,1640.0,1123.0,27.724999,26.350
2245,0.6,865.25,-200,4.765319,751.50,65.0,996.00,64.0,1450.5,837.0,21.350000,42.325

In [24]:
testY[:2]

1673    0.965174
2245    1.062529
Name: AH, dtype: float64

In [25]:
rf.predict(testX[:2])

array([0.97508945, 1.05781132])

In [26]:
svr.fit(trainX,trainY)

SVR()

In [27]:
testX[:2]

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH
1673,2.1,1155.75,-200,11.546103,1033.75,154.0,813.25,122.0,1640.0,1123.0,27.724999,26.350
2245,0.6,865.25,-200,4.765319,751.50,65.0,996.00,64.0,1450.5,837.0,21.350000,42.325

In [29]:
testY[:2]

1673    0.965174
2245    1.062529
Name: AH, dtype: float64

In [30]:
svr.predict(testX[:2])

array([1.36237439, 1.34242037])

In [31]:
hr_data = pd.read_csv("https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/HR_comma_sep.csv.txt")

In [32]:
hr_data.rename(columns={'sales':'dept'},inplace=True)

In [33]:
hr_data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [36]:
feature_data = hr_data.drop(columns = ['satisfaction_level'])

In [35]:
target_data = hr_data.satisfaction_level

In [37]:
feature_data.head()

,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept,salary
0,0.53,2,157,3,0,1,0,sales,low
1,0.86,5,262,6,0,1,0,sales,medium
2,0.88,7,272,4,0,1,0,sales,medium
3,0.87,5,223,5,0,1,0,sales,low
4,0.52,2,159,3,0,1,0,sales,low

In [38]:
from sklearn.preprocessing import LabelEncoder

In [39]:
le = LabelEncoder()

In [40]:
hr_data['dept_en'] = le.fit_transform(hr_data.dept)

In [41]:
hr_data.sample(5)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept,salary,dept_en
5907,0.84,0.90,3,178,2,0,0,0,accounting,medium,2
391,0.45,0.55,2,148,3,0,1,0,sales,low,7
10218,0.99,0.68,4,235,3,0,0,0,product_mng,low,6
10924,0.92,0.67,2,252,2,0,0,0,sales,low,7
6070,0.78,0.47,4,129,2,0,0,0,technical,medium,9

In [45]:
le.classes_

array(['IT', 'RandD', 'accounting', 'hr', 'management', 'marketing',
       'product_mng', 'sales', 'support', 'technical'], dtype=object)

In [46]:
le_salary = LabelEncoder()

In [47]:
hr_data['salry_en']= le_salary.fit_transform(hr_data.salary)

In [49]:
feature_data = hr_data.drop(columns=['satisfaction_level','dept','salary'])

In [50]:
feature_data

,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept_en,salry_en
0,0.53,2,157,3,0,1,0,7,1
1,0.86,5,262,6,0,1,0,7,2
2,0.88,7,272,4,0,1,0,7,2
3,0.87,5,223,5,0,1,0,7,1
4,0.52,2,159,3,0,1,0,7,1
...,...,...,...,...,...,...,...,...,...
14994,0.57,2,151,3,0,1,0,8,1
14995,0.48,2,160,3,0,1,0,8,1
14996,0.53,2,143,3,0,1,0,8,1
14997,0.96,6,280,4,0,1,0,8,1
14998,0.52,2,158,3,0,1,0,8,1

In [55]:
trainX,testX,trainY,testY = train_test_split(feature_data,target_data)

In [56]:
trainX.shape

(11249, 9)

In [57]:
hr_data.shape

(14999, 12)

In [58]:
testX.shape

(3750, 9)

In [ ]:
dt = DecisionTreeRegressor()

In [59]:
dt.fit(trainX,trainY)

DecisionTreeRegressor()

In [60]:
testX[:2]

,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,dept_en,salry_en
1733,0.52,2,160,3,0,1,0,8,1
11897,0.97,3,174,3,0,0,0,7,1

In [61]:
testY[:2]

1733     0.42
11897    0.73
Name: satisfaction_level, dtype: float64

In [64]:
dt.predict(testX[:2])

array([0.45, 0.73])